class program // основная точка входа приложение начинает выполняться внутри этого класса
{
    static void Main(string[] args) // главный метод данного приложения и начало программы начинается с него
    // чтобы что-то реализовать нужно написать код внутри метода Main
    // если код будет вне этого метода, никах не будет с ним связан, это будет недостижимый код
    {
        // // // Console.WriteLine("Тук-тук, Neo!"); // метод выводит текст на консоль
        // // // // var input = Console.ReadLine(); // метод сохранения в переменную того, что ввёл пользователь
        // // // Console.ReadLine(); // в данном примере отавляем так, т.к. ничего не принимает
        // // int i = 5; // инициируем переменную int с именем i / присваиваем ей значение 5
        // // i = 6; // потом можем присвоить значение 6
        // // // i = "dasd" // если в переменную целочисленную попытаться засунуть строку,
        // // // то компилятор выдаст ошибку, объявления комментария, ошибка была подчёркнута красным, как в ворде
        // // так же будет показывать ошибку, если в var с присвоенным значением числа попытаться запихнуть строку
        // var i = 5;
        // i = "dasd"
    }
}