     // первый вариант с целыми числами, которые делятся др на др цельно
// int numberA = 10;
// int numberB = 5;
// Console.WriteLine(numberA / numberB);


     // второй вариант
// int numberA = 12;
// int numberB = 5;
// Console.WriteLine(numberA / numberB);
     // снова получили 2
     // такой ответ потому что мы работаем в целых числах

// нужно поправить приложение, чтобы деление было делением
//  для этого вместо контейнера (место для хранения данных - переменная int - это сокращённо от интеджер) 
// ставим/заменяем на контейнер double
// переводится как "двойной" или "двойной точности"
// "double" это тип данных в языке программирования, который представляет числа с плавающей точкой 
// с большей точностью, чем тип данных "float"
int numberA = 12;
int numberB = 5;
Console.WriteLine(numberA / numberB);